"""
Задание 7.01
=============
Просуммировать  n чисел
Не учитывать числа кратные 5
Циклами  for  while c  пред и пост условиями
"""

def full_func(*args, **kwargs):
    print(args)


def full_func(*args, **kwargs):
    print(args)


def full_func(*args, **kwargs):
    print(args)


def full_func(*args, **kwargs):
    print(args)


full_func(1,2,3,a=4,b=5,c=6)
full_func(1,2,3,a=4,b=5,c=6)
full_func(1,2,3,a=4,b=5,c=6)
full_func(1,2,3,a=4,b=5,c=6)


